<?xml version='1.0' encoding='UTF-8'?>
<mdcompxml><meta when="November 02, 2024 12:00:00 AM" /><doc name="Welcome.md">This Obsidian Vault is the official documentation and stuff for the [[Megarchive Warehouse Show]].

This show is written and created by MXPSQL Server 20953 Onetechguy. Its still a concept, but its a big one. A **VERY VERY BIG** one that has a **VERY BIG** scope that is **VERY BIG** and encompasses may ideas and concepts.

This Obsidian Vault is a migration from the former TiddlyWiki notetaking wiki software, as I find this nicer.</doc><doc name="Episodes.md">Episodes are slices of lifes and competition action for the [Megarchive Warehouse Show](Megarchive%20Warehouse%20Show.md).  
They show what happens in some time-span.

Some of these episodes are competitions, while some may be slices of lifes. There may be even a single episode split into two halves (A and B) with each half being competition and slices of lifes respectively.

#episodes</doc><doc name="EP1.md">
This is the first [Episodes](Episodes.md) of MWS. 

Everyone is seen living their life, when suddenly JHR decides to propose a competition. He will be the one to host it. What do they do? Bet and stake things (JHR won't as he's the host, and he won't be a part of the bet).

#episodes </doc><doc name="Megarchive Warehouse Show.md">This is a large object show that encompasses older object show of mine such as [[AACOS]] and others. Its based of my megarchive manual archives and collections. This show is part of the larger umbrella of ObjecWeb36.

This show is both competition and slice-of-life based.

The abbreviation for this show is MWS.

The show that it encompasses is:
- [[AACOS]]
- Some parts of an old part of old ObjectWeb36.

The name Megarchive in both MWS and my megarchive manual collections is a portmanteau of *Mega* and *Archive*.</doc><doc name="AACOS.md">AACOS is an Object Show all about Air Conditioners, Heat Pumps and their companion accessories. This show used to be independent, but is now part of the larger [[Megarchive Warehouse Show]] that also combines others.

AACOS stands for AACOS Air Conditioner Object Show. Its a recursive acronym cus its fun.

The characters present in AACOS are [air conditioners](Air%20Conditioners.md).</doc><doc name="TODOs.md">---

kanban-plugin: board

---

## Eternity

- [ ] GIve [JHR](JHR.md) siblings and cousins. Then assimilate JHR into a person lith kinda like [VXU](VXU.md) with his siblings as he and his siblings are capable of multi-split unit operation.
	JHR's cousin is his IVT version (superior and inferior at the same time)


## Backlog



## Todo

- [ ] Add a new smug character named Avxy, which is a Sharp AIOT air conditioner. He is a smug little sh##.
- [ ] Add Angelsaph, a Gree Saphire air conditioner. He has a golden-white shiny halo made of solid gold-titanium-platinum-aluminium alloy. This halo is part of his body and can act as a protection. It can regenerate slowly if its damaged.


## Current



## Done

**Complete**




%% kanban:settings
```
{"kanban-plugin":"board","list-collapse":[false,false,false,false,false]}
```
%%</doc><doc name="Characters.md">
They are people of the [[Megarchive Warehouse Show]]. Some of them came from old shows such as:

- [AACOS](AACOS.md)

There is object:
- Racism
- Violence (Slapback and brutal)
Cus its funny.

Birth in MWS is refering to the date they were created/manufactured. Its based on when their IRL versions were released to the public.</doc><doc name="Fisios.md">Fisios is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]].

## Identity

She is an LG F1443KDS [washing machine](Washing%20Machines). Her name is pronounced as Fis-ios, but she can be called as just Fis.

She was born in 2011. She is a cisgender and heterosexual female (she/her).

#washingmachines </doc><doc name="Wheamy.md">Idendiby is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]].

## Identity
Wheamy is an LG WM2101HW [washing machine](Washing%20Machines). His name is pronounced as Whim-my.

He was born on December 19, 2009. He is a cisgender and pansexual male (he/him).

## Personality

TBA

## Relations

#washingmachines </doc><doc name="Washing Machines.md">These [character](Characters) are a class of species in the [[Megarchive Warehouse Show]].

#washingmachines
</doc><doc name="Idendiby.md">Idendiby is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]].

## Identity

Idendiby is a Samsung WW11DB9B84GD [washing machine](Washing%20Machines). His name is a play one the 11DB part and Identity (I am not good with names) and is pronounced as Identiby.

He was born on August 7, 2024 as a Singaporean. He is your male that doesn't know what is identity except for his own name, species and age.  
If skin color is considered, he is gray.

## Personality
TBA

## Relations


#washingmachines


&gt; Created in October 31, 2024.</doc><doc name="Piss.md">Piss is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]].

## Identity

Piss is a Sharp SJ-F79PS [refridgerator](Refridgerators.md). He is here because its my childhood refridgerator. His name is pronounced as just Piss, yeah actual pee Piss. His name is derived from the PS part of his SJ-F79PS species.

He was born in 2007 as an Asian-European. Piss is a cisgender and heterosexual male.
If skin color is considered, he is gray.


## Personality


## Relations

#refridgerators


&gt; Created in October 31, 2024.</doc><doc name="Refridgerators.md">These [character](Characters) are a class of species in the [[Megarchive Warehouse Show]].

#refridgerators</doc><doc name="ToshyRAVi.md">ToshyRAVi is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. She originally appeared in [[AACOS]].

## Identity

She is a Toshiba RAV-GM301KRTP-A wall-mounted [heat pump](Air%20Conditioners.md). Her name is pronounced as Toh-she-Rav-ee, where the Rav-ee is pronounced like the Ravi in *Ravioli*.

She was born in 2021. She is a cisgender female (she/her).

If skin color matters, ToshySMUT is white.
## Personality

ToshyRAVi is a very vibrant, adventurous and unhinged girl. ToshyRAVi, with her adventurous nature, likes to explore a lot.

ToshyRAVi is very optimistic, enthusiastic and curious in life and her own self. She always asks herself whats out there to explore discover, all the beautiful things in life that has never been seen before. Her vibrant and optimistic nature also makes her slightly unhinged, where she can be hyperactive and crazy!

Her adventurous nature also can put her in danger at times. She is not the most cautious person here, as her impulse can override her cautiousness, if it appears. She usually goes without thinking, like leaping without thinking.

Her enthusiasm is very infectious, and it inspires others. Everyone else becomes motivated with her fun personality. It brings everyone's color and personality to life, when normally they would be dead in the inside.

## Relations

#airconditioner</doc><doc name="MHeLy.md">MHeLy is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. She originally appeared in [[AACOS]].
## Identity

MHeLy is a wall-mounted Sharp AY-A9MHL [air conditioner](Air%20Conditioners.md). MHeLy is the 5th generation in the Sharp Sayonara Panas series, AKA she is the **Sayonara Panas V/Sayonara Panas 5** air conditioner. Her name is pronounced as M-H-Elly. You can write her name as MHLy (That's the original, but somehow it got lost), but she would prefer if you write her name as MHeLy.

She was born in March 19, 2012. She is a cisgender and heterosexual female.

MHeLy is one of the most intelligent person in MVS. She's also one of the weaker ones though.

If skin color matters, MHeLy is gray and silver.

Her elder brother is [KaHLium](KaHLium.md)

## Personality

MHeLy is one of the nicer people in MVS. This is probably because she's a girl (More like woman. Wait, isn't that sexist? Probably, probably not. Nah).

MHeLy is a kind-hearted and empathetic to others. She is very creative with her work and competition, and even innovative. She is kind-hearted and willing to help others, even sacrificing herself at times. MHeLy is a pacifist, but she would still do violence if she has no choice.

MHeLy may also have self-doubt and be insecure at times, where she should withdraw and isolate herself from the others. She sometimes feels that with her principle of being nice and only attacking for defense, that she is used. But then she will bounce back!

MHeLy with her kindness, mostly forms good bonds and relationships with the others. She looks for friends too, but there are others who don't want to be friends with her. Some even declare themselves as enemies to MHeLy, but her kindness will pay off in the end.

So, MheLy is one of the warm characters in MVS.
## Relations

### [JHR](JHR.md)

MHeLy is a close friend to JHR, and vice versa. They have known each other for longer compared to anybody else in them. They have enjoyed time together, playing and watching the silver of the night skies.

## [KaHLium](KaHLium.md)

MHeLy is KaHLium's younger sister. KaHLium loves her and is protective of her. MHeLy motivates and makes KaHLium happy when he's down.

#airconditioner #sayonarapanas</doc><doc name="WELLPan.md">WELLPan is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. He originally appeared in [[AACOS]].

## Identity

WELLPan is a Samsung AS09BPAN wall-mounted [heat pump](Air%20Conditioners.md). His name is pronounced as Well-Pan. His name is derived from the PAN of his species' model name and the *Well equidistributed long-period linear (WELL)* random number generator.

WELLPan was born in July 2007. He is a cisgender and helisexual male (he/him). Yes, he sexually identifies as an Apache Attack Helicopter. This is not a joke (kinda).  
If skin color matters, he is white.

He is one of the strongest person in the Megarchive Warehouse Show. He is also one of the most intelligent person in MVS. WELLPan is also one of the slowest person in MVS.

## Personality

WELLPan is one of the chillest and most easygoing person in the Megarchive Warehouse Show. He is pretty much the easygoing vibe carrier in AACOS. He has that unhinged, yet chill humor. WELLPan is also kinda lazy and unmotivated at times.

WELLPan is also very smart. He is a bookworm. He likes to read a lot. This shows that WELLPan is smart, but is too unmotivated to do things. He can lead and serve as a voice of guidance and leadership to motivate and guide others (his competitors/friends), but only if he is bothered to do so.

WELLPan may struggle with motivation and laziness, but don't underestimate him. He has the potential to win, but he doesn't want to. He is too chill. Everyone likes him because he is easy to get along with.

Just don't disturb him when he's reading or underestimate him, he doesn't like that.

## Relations

### [Aurl](Aurl.md)
They are frenemies, but they are more of a friend that enemies. The only conflict that they can be in is in a friendly little competition of who can be the chillest, and WELLPan always wins. They just hang out with each other.

#airconditioner</doc><doc name="PKayFsa.md">PKayFsa is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. He originally appeared in [[AACOS]] under a slightly unextended name.

## Identity

He is a Mitsubishi Electric (Mr. Slim) PKH-4FKSA [air conditioner](Air%20Conditioners.md). His name is pronounced as Pee-Kay-Visa.

He was born in 1997. He is a cisgender and heterosexual male.
## Personality

He is kinda drunk, but not rlly (This is referencing the Pee-Kay which means drunk in some hindi language).

He is quite bubbly and umm not that sharp in his mind. He is quite caring though, and will try to help you with what he has. PKayFsa may get distracted with things though, and you should probably guide him with what topic is he talking about.

PKayFsa may not have the intelligence of [CKHSC](CKHSC.md) and [ASTAC](ASTAC.md) but he will try. The irony is that PKayFsa is older than them. He is still learning, and will use what he experienced on advising others. He may get distracted though.

## Relations

#airconditioner </doc><doc name="JVXH.md">JVXH is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. She originally appeared in [[AACOS]].

## Identity

She is a wall-mounted Daikin FTXG09HVJU [heat pump](Air%20Conditioners.md), a **Daikin Quaternity** unit. JVXH's name is pronounced as Jay-Vee-Sih or Jay-Vax. She's an inferior version of [RXe](RXe.md) in a nutshell.

JVXH, being an inferior version to RXe, has the same design. There is just a little difference though.

JVXH was born in July 2009. She is a cisgender and lesbian female (she/her).  
If skin color matters, she is gray just like RXe.

## Personality

JVXH is a chaotic neutral girl. She's got that school shooting capabilities in her, but she's also good with people. JVXH is also a force not to underestimate, especially with her loyalty to her friends.

JVXH is very loyal to her friends, and will protect them. She is very protective and resourceful, and she will even do anything to protect her friends, even crossing some people's limits.

JVXH is also quite skilled at deceiving and manipulation. She's also happy to murder others. Ruthless and unpredictable, she kills and lacks empathy for others who are obstacles to her. She doesn't care or feel remorse, she enjoys their pain as they die. She's a sadist.

JVXH is still a leader in this case, and she can lead others with her skills. But don't be a dead weight, or you'll face her wrath and doom. She can influence others to do the job for everyone, but sometimes also manipulate them to be deceived into doom.

## Relations

### [RXe](RXe.md)

They are couples. They are very close to each other.

#airconditioner</doc><doc name="JKE.md">ASTAC is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. He originally appeared in [[AACOS]].

## Identity

He is a Panasonic wall-mounted CS-CE12JKE-1 [heat pump](Air%20Conditioners.md). His name is pronounced as Jay-Kay-Ee, or Jake, though he prefers the first one.

He is unique from other Panasonics in that his power lamp also acts as a deice lamp. He would go to deice mode when the area he is currently in is too cold. His power/deice lamp is normally green (not deice), but blue in deicing mode.

He was born in 2010. He is a cisgender and heterosexual male.

If skin color matters, JKE is gray.

## Personality

He is a very chatty and hyperactive person. He will rant about a lot of things. Yap and babble he will! Anything, he can't keep his mouth shut. Whatever you do, don't share secrets with him as he would probably share it to others. He is also hyperactive and energetic, stimming and running about. He is basically like a little child on a sugar rush.

That is when he is not in deice mode (Indicated by his power/deice lamp being green). When he is in deice mode (power/deice lamp is blue), he is a different person. He is less active and chiller. He would not do all those things when he isn't in deice mode. He just listens, as he is passive. No talking from him, at all.

## Relations

#airconditioner </doc><doc name="ToshyMEM.md">ToshyMEM is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. She originally appeared in [[AACOS]].


## Identity

She is a Toshiba wall-mounted MMK-AP0124MHP-E1 [heat pump](Air%20Conditioners.md). Her named is pronounced as Toh-she-mem. Her name is unique as its not based of her model name, but based of her species's brand and unrelated words (Toshy from Toshiba, MEM from somewhere).

She was born on 2015. She is a Cisgender and Heterosexual female (she/her).  
If skin color matters, she is white.

## Personality

She is a pretty fierce contestant and competitor. She has some strong perseverance and filled with determination, characterized by her relentless drive to win the show! ToshyMEM is also fairly careful at challenges and life in general. ToshyMEM is very competitive and she will stop at nothing to win the show, not even others sometimes. 

She may manipulate others to win and advance her, but only if she has to. She's not a sociopath you know, she has feelings too. ToshyMEM will push herself and others to the limits to win. ToshyMEM may also even push the others beyond their limit, which may be lower than her own. This can create tensions between others as her intense focus on winning may cause relationships to strain with others. This straining occurs because ToshyMEM may be ruthless or overly competitive in winning towards others.

## Relations

### [WELLPan](WELLPan.md)

To ToshyMEM, WELLPan is just dead weight. She may appreciate his presence, but he doesn't really do much.


#airconditioner</doc><doc name="RXe.md">RXe is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. She originally appeared in [[AACOS]].

## Identity

RXe is a Daikin wall-mounted FTXR50EV1B9 [heat pump](Air%20Conditioners.md). RXe is the **old Daikin Ururu-Sarara** series.

RXe was born in 2007. She's a cisgender and lesbian female (she/her).  
If RXe's skin color matter, she is gray.

## Personality

She's just evil, with a slight bit of goodness (but massive to those close to her though). Don't trust her at all (mostly), her evilness overpowers her goodness unless you're really close with her.  Don't also underestimate her, you don't know how strong and evil she is. She is a force to be reckoned with.

RXe is fearless, and is reckless. She is evil to live for! She is evil to live her life! RXe would unapologetically and uncaringly push other people, limits and the challenges away. Others would be in awe, and they might also be hurt. RXe doesn't care though, she is just evil for this.

RXe is also manipulative with charisma. She makes herself seem good and attractive, but all she wants is to use and manipulate them. Her leadership skills is good, but she leads others to doom.

RXe has a bit of goodness and kindness, but is largely overshadowed and overpowered by her evilness. This goodness is fairly present and can overpower her evilness if she's with a really close friend of hers. But just don't be near her most of the time for the sake of you, please.

## Relations

### [MHeLy](MHeLy.md)

MHeLy is one of the people RXe is genuinely kind to. MHeLy has been supporting RXe, despite RXe being the opposite to her. RXe respects her as a person for being so nice despite RXe doing not so nice things.

### [JVXH](JVXH.md)

They are couples. They are very close to each other. JVXH is one of the people she's actually genuinely kind to, as they are lesbian couples.

#airconditioner </doc><doc name="VXU.md">VXU is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. They originally appeared in [[AACOS]], an old part of old ObjecWeb36. This is because they are not just one person.

## Identity

VXU is actually a multi-system triplet composed of 3 mind/people that is also a single person:
- DeltaCXG (DCXG)
- CTUX
- MXU

MXU is Daikin 2MXU40GV1B. DeltaCXG is a wall-mounted Daikin CTXU42G2V1B, while CTUX is a wall-mounted Daikin CTXU50G2V1B. This is because VXU is a **Daikin Multi-Ururu Multi-Split system**. VXU is a [heat pump](Air%20Conditioners.md) system, as all their members (DeltaCXG, MXU and CTUX) are heat pumps.

CTUX was from AACOS while DeltaCXG was from an old part of old ObjecWeb36.

They are attached to a steel board with pipes and wires connecting them together, making them one. MXU is at the bottom, the legs of VXU, while DeltaCXG and CTUX is above MXU (CTUX is placed higher than DeltaCXG). MXU is the leg of VXU, while DeltaCXG and CTUX despite having legs, is instead the arms.

Both MXU and CTUX were born in August 12, 2008. DeltaCXG is a later addition to them, as he was born in November 11, 2011. VXU is non-binary (they/them), but their individual members are all strictly cisgender and heterosexual male. The reason why VXU is non-binary, but MXU, CTUX and DeltaCXG is male is because VXU is not just one person, but three person as one person.

If skin color matters, VXU is white.

## Personality

Since VXU is a triad that is also a single person, each of the people in VXU has their own personalities. Each of them has contrasting personality that can balance each other out.

### DeltaCXG

DeltaCGX is the sociopathic, sadistic and uncaring saboteur. He cares for his siblings (AKA those who is part of VXU), but doesn't care about others except for a select few.
## CTUX

CTUX is the overconfident and arrogant, but strong willed competitor, and is a good person in general. He is confident and determined. He can lead people with his great leadership skills, and is intelligent. He can strategically think.

CTUX's arrogance due to his confidence may lead him to underestimate others.

## MXU

MXU is the gentle one.

## Relations



#airconditioner</doc><doc name="ZSRK.md">ZSRK is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. He originally appeared in [[AACOS]].

## Identity
He is a Mitsubishi Heavy Industries SRK60ZSXA-W [heat pump](Air%20Conditioners.md). His name is pronounced as Z-Serk, or Caesar if it starts with Z instead of C and has an extra k in the end (Zaesark).

He was born in 2017. He is a cisgender and heterosexual male.

## Personality

In a nutshell, a detective.

ZSRK has a fierce personality, with the mind of a detective and a great deducer. He is ready to dive first into mysteries. He uses his awesome deductive and analysis skill to unravel even some of the most complex, or even unsolved puzzles. He knows where to look for things, and he knows what to do next. That's some great level detective skills.

ZSRK has a short-temper though, and that can lead him to do impulsive actions. He is also fairly stubborn at seeing other people's perspective. This can make him and others hard to solve mysteries. ZSRK is also fairly assertive with other people, and he will guide them on what to do.

ZSRK with his analytical and assertive nature makes him formidable. He is not to be underestimated.

## Relations

#airconditioner 
</doc><doc name="Flerovy.md">Flerovy is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]].

## Identity

Flerovy is a Daikin FVQ125BV1B floor-standing [heat pump](Air%20Conditioners.md). His name is pronounced Flerovy.

Flerovy was born 2008. He is a cisgender and heterosexual male.

## Personality

TBA

## Relations

#airconditioner </doc><doc name="JHR.md">JHR is a [character](Characters) the host of [[Megarchive Warehouse Show]]. He also used to be the host of [[AACOS]], but you know its now a part of the [[Megarchive Warehouse Show]].

## Identity
He is a wall-mounted Sharp AY-XPC12JHR [heat pump](Air%20Conditioners.md). His name is pronounced as Jay-Eitch-Ar and derived from the JHR part of his species as a Sharp AY-XPC12JHR.

JHR can actually be part of a multi-split system, but he is currently a single-split system. Later he will be part of one, but for now he is just single.

JHR is one of the most intelligent person in MVS.

He was born in February 15, 2008 as a European. JHR is a cisgender and bisexual male (he/him).  
If skin color is considered, he is white.

## Personality

In a nutshell, he behaves differently in different situations. JHR is still a good guy though.
### As a host
JHR is warm and welcoming, albeit strict at times. He is also a workaholic, so he would probably get depressed if he doesn't do anything. He is the host after all, what do you expect? He wants and needs to do his job.

### As a normal person
As a normal person, he is a good person to hang out with, but can be weird and sociopathic at times. He is not exactly normal in his mind, so he may speak random garbage that you weren't supposed to hear.

### Sociopathy
In his sociopathy, he is sadistic (not murderous). He likes pain, but isn't that all? Anyways. He is also good to hang out as he can rant and chat with you about many things.

## Relations

### [MHeLy](MHeLy.md)

MHeLy is a close friend to JHR, and vice versa. They have known each other for longer compared to anybody else in them. They have enjoyed time together, playing and watching the silver of the night skies.


#airconditioner


&gt; Created in October 28, 2024.</doc><doc name="TERAS.md">TERAS is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. He originally appeared in [[AACOS]].
## Identity

TERAS is a Hitachi RAS-14EH2 wall-mounted [heat pump](Air%20Conditioners.md). His name is prounced as Teh-Ras, or *'teras'* in Indonesian.

Teras was born in April 11, 2006. He is a cisgender and heterosexual male (he/him).

[Raiie](Raiie.md) and [RACK](RACK.md) is the elder sibling to TERAS.

If skin color matters, TERAS is white.

## Personality

TERAS is a jokester, a prankster. He likes to prank people, and tell jokes. His pranks are harmless and very funny, albeit humiliating towards the victim. His jokes would make people laugh so hard that they would usually fall off their chairs.

His jokes are that funny eh? His jokes are usually unhinged, and poke fun at dark humour. yes, he pokes fun at sensitive topics, but it always ends up as being inoffensive. He is very good at making offensive things, inoffensive, and vice versa. Don't worry, he has discretion.

He is a nice guy if he isn't always telling jokes. He can be serious, but it's mostly him telling stories and thoughts from his heart. To those close to him, he will tell you offensive jokes.

## Relations

### [Raiie](Raiie.md)

TERAS is the younger brother to Raiie. TERAS pranks Raiie almost all the time. Raiie finds it funny, but annoying. Raiie sees TERAS as an unsupervised toddler.

### [RACK](RACK.md)

TBA


#airconditioner #hitachitriplets </doc><doc name="CKHSC.md">CKHSC is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. He originally appeared in [[AACOS]].

## Identity

He is a wall-mounted Panasonic CS-C24CKH-7 [air conditioner](Air%20Conditioners.md). His name is pronounced as Check-See.

He was born in 2003. He is a cisgender and heterosexual male (he/him) because he is too old to be bothered with LGBTQ.  
If skin color matters, CKHSC is white.

## Personality

CKHSC an old person. He is a wise, but quite traditional guy. He is kinda like a grandfather to the MWS cast, but he knows he still needs to learn more about now and that he needs to start adapting.

CKHSC has a lot of experience in life, and so he can tell others who are younger, and sometimes older about life and what can it throw. He basically is kinda like a dictionary, but for life situations and what to do. CKHSC also has stories to tell.

CKHSC also has a few issues. He is a traditionalist, or he likes to stick with his old ways. He can be stubborn at times, but budge him enough and he will relent. This is because he thinks that the old ways are superior compared to the new ones.

Don't worry, CKHSC believes that what he is doing is for the best for everyone. He cares for them. CKHSC also knows that he must learn more about the current world as it has changed a lot and that he must adapt and leave some of his old ways behind that are not suitable for the current world.

## Relations

### [ASTAC](ASTAC.md)

They are friends, but have a friendly rivalry. CKHSC is aware that ASTAC is more open to changes compared to himself.

#airconditioner </doc><doc name="ToshySMUT.md">ToshySMUT is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. He originally appeared in [[AACOS]].

## Identity

He is a Toshiba RAV-SM804UTP-E 4-way cassette  [heat pump](Air%20Conditioners.md). His name is pronounced as Toh-She-Smut.

He was born in 2013. He is a bisexual demiboy (he/them).

If skin color matters, ToshySMUT is white.

## Personality

He is rude and smutty, but not bad. He just doesn't know how to express himself nicely. He is just a poor misunderstood soul, who is trying to be nice but people take him as a rude person.

ToshySMUT appears as rude as he would interrupt people randomly, and say not so nice stuff about others. He would sometimes drop bombshell truths about others when its not appropriate. This is why people see him as a smut.

ToshySMUT is a good person though. Its just that he doesn't know how to express himself nicely, and in fact he also doesn't know how to properly socialize. He is too isolated for it. If he is not rude, he can tell you stories from his heart and his struggles.

## Relations

#airconditioner </doc><doc name="Raiie.md">
Raiie is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. He originally appeared in [[AACOS]] with a different name.

## Identity

He is a Hitachi RAI-25NH5 4-way cassette [heat pump](Air%20Conditioners.md). His name is pronounced as Rai, or Ra-yi.

He was born on June 6, 2005. He is a pansexual genderfluid person. Raiie prefers to be male (he/him), but Raiie will change if he has too when the circumstances and situation warrants it (such as male persecution).

[TERAS](TERAS.md) is the younger brother of Raiie, while [RACK](RACK.md) is the elder brother to Raii.

If skin color matters, he is white.
## Personality

TBA

## Relations

### [TERAS](TERAS.md)

TERAS is the younger brother to Raiie. TERAS pranks Raiie almost all the time. Raiie finds it funny, but annoying. Raiie sees TERAS as an unsupervised toddler.

### [RACK](RACK.md)

TBA

#airconditioner #hitachitriplets</doc><doc name="Aurl.md">Aurl is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. He originally appeared in [[AACOS]].

## Identity

He is a wall-mounted Fujitsu 15RLS2H [heat pump](Air%20Conditioners.md). His name is pronounced Oral as in Oral speech.

Aurl was born in 2013. He is a cisgender and heterosexual male.  
If skin color matters, Aurl is white.

## Personality

He is both positive and negative. He is normally calm, but no one can beat the chillness of [[WELLPan]].

He normally is unfazed and unbothered, or that is what he looks like on the surface. He is quite observant on his surrounding, allowing him to gather intel on others, and their browsing history. He is slightly disappointed with what they had looked up, but its not that major nasty.

This intelligence allows him to execute cunning plans and outsmart others. He also has a volatile temper, that can get really nasty at times. If he's angered, he is unpredictable! He might even start a school shooting all of a sudden!

Inside him, there is a dark part of him that wants him to hurt others. That dark part of him is sadism, and it manifests during his temper outbreak.

## Relations

### [WELLPan](WELLPan.md)

They are frenemies, but they are more of a friend that enemies. The only conflict that they can be in is in a friendly little competition of who can be the chillest, and WELLPan always wins. They just hang out with each other.


#airconditioner</doc><doc name="ASTAC.md">ASTAC is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. He originally appeared in [[AACOS]].

## Identity

He is a wall-mounted Fujitsu ASTA18LCC [heat pump](Air%20Conditioners.md). His name is pronounced as Asta-See, like the drug Ecstacy!

He was born in 2009. He is a cisgender and heterosexual male (he/him).

## Personality

ASTAC is an old person. He is wise, but less knowledgable compared to [CKHSC](CKHSC.md) (who knows about more things than ASTAC). ASTAC is also like a grandfather figure to the MVS cast.

ASTAC has one starking difference compared to CKHSC, in that he is less stubborn and more open to new things. He likes trying out new things and compare them to the old days. He is very experimental.

ASTAC is also quite cautious at new things though, but he is quite accepting. He is cautious so he can be ready if the new thing turns out to be harmful.


## Relations

### [CKHSC](CKHSC.md)

They are friends, but have a friendly rivalry. CKHSC is aware that ASTAC is more open to changes compared to himself.

#airconditioner</doc><doc name="ToshyFEN.md">ToshyFEN is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. He originally appeared in [[AACOS]].

## Identity

ToshyFEN is a Toshiba floor-standing RAV-RM561FT-EN [heat pump](Air%20Conditioners.md). His name is pronounced as Toh-she-Fen.

He was born in 2021, as a British person. He is a cisgender and heterosexual male.

He actually has two minds, and each of his minds has a face. The main mind of ToshyFEN is at the front panel of his main body, while the auxilliary mind of ToshyFEN is in his controller.

He is one of the most durable person in MVS; He can survive injuries that would incapacitate or even kill others, and he can tolerate severe pain such as crotch kicks. ToshyFEN is also heavy.

If skin color matters, ToshyFEN is white.

## Personality

He basically has two personalities that are volatile at changing about.

He has this one personality where he is really chill, and likes to chat. He can never be as chill as [WELLPan](WELLPan.md), but he is chill. He just listens, and talk a little. He likes small talk, and big talk. He is just there for WELLPan mostly, but can be there for others. Basically he just does nothing except listen and yap.

Then he has this other personality where he is straight up unhinged, crazy, insane, angry and violent. He commits harms to those who caused him this, and a bit of others. He isn't a sadist, but he is crazy. He literally chases others to no end with this. Yelling and screaming like a banshee as he runs. To no end he does this with no obvious goal at times.

#airconditioner </doc><doc name="RACK.md">Raiie is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. He originally appeared in [[AACOS]].

## Identity

He is a Hitachi RAK-60NH4 wall-mounted [heat pump](Air%20Conditioners.md). His name is pronounced as rack, just like rack-mounted servers.

He was born in 2003. He is a cisgender and heterosexual male.

He is the elder brother and sibling to [TERAS](TERAS.md) and [Raiie](Raiie.md) respectively.

If skin color matters, RACK is beige.

## Personality

TBA

## Relations

### [TERAS](TERAS.md)

TBA

### [Raiie](Raiie.md)

TBA

#airconditioner #hitachitriplets </doc><doc name="GiSY.md">GiSY is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. He originally appeared in [[AACOS]].


## Identity

She is a wall-mounted Sharp AH-AP12GSY [air conditioner](Air%20Conditioners.md). Her name is pronounced Jee-See.

She was born in 2008. She is a pansexual demigirl (she/they).

If skin color mattered, she is white.

## Personality
TBA

## Relations

#airconditioner </doc><doc name="KaHLium.md">KaHLium is a [character](Characters) as a contestant on the [[Megarchive Warehouse Show]]. He originally appeared in [[AACOS]].

## Identity

KaHLium is a wall-mounted Sharp AH-AP5KHL [air conditioner](Air%20Conditioners.md). He is the 3rd generation in the Sharp Sayonara Panas series, AKA she is the **Sayonara Panas III/Sayonara Panas 3** air conditioner.  
His name is pronounced as Kalium, which is the latin name of Potassium. Yes! His name is a reference to Kalium!

KaHLium was born on September 11, 2009 (Wai r u luking laik dat?). He is a cisgender and heterosexual male (he/him).

If skin color matters, KaHLium is white.

His younger sister is [MHeLy](MHeLy.md).

## Personality

TBA

## Relations

### [MHeLy](MHeLy.md)

MHeLy is KaHLium's younger sister. He loves her, and is protective of her. MHeLy motivates and makes KaHLium happy when he's down.

#airconditioner #sayonarapanas </doc><doc name="Air Conditioners.md">These [character](Characters) are a class of species in the [[Megarchive Warehouse Show]]. 

The Air Conditioners encompasses Air Conditioners, Heat Pumps and their accessories such as their controllers. Well, the last in the bunch of those objects are technically incorrect, but eh. So Air Conditioners are just megaclasses.

The air conditioners and heat pumps can have multiple body types. Here are the available body types:

- Wall-mounted
- Cassette
	- 1-way
	- 2-way
	- 4-way
	- 360
- Floor Standing
- Window
- Floor Console

And then there are the controllers, which are usually companions to the main unit. The controllers may be independent though.

#airconditioner</doc></mdcompxml>