[
  "obsidian-git",
  "obsidian-kanban",
  "OA-file-hider",
  "terminal",
  "obsidian-shellcommands",
  "tier-list",
  "obsidian-tasks-plugin",
  "obsidian-link-converter",
  "global-search-and-replace",
  "digitalgarden",
  "templater-obsidian",
  "dataview"
]